In [6]:
#pip install PyMySQL

In [7]:
import pymysql as py
print('Done')

Done

In [8]:
conn = py.connect(user = 'root',
                  password= 'anshika0712',
                  host= 'localhost',
                  autocommit = True)
print('Connection Created Successfully!!')
print('Done')

Connection Created Successfully!!
Done

In [9]:
cur= conn.cursor()
print ("Cursor is created")

Cursor is created

In [10]:
q1= ''' create database day5;'''
cur.execute(q1)
print("Data Base Created")

Data Base Created

In [11]:
q='''use day5;'''
cur.execute(q)
print("Done")

Done

In [12]:
q2= '''create table s_details(
SID int not null,
S_Name varchar(50),
S_Course varchar(50),
Address varchar(50));'''
cur.execute(q2)
print ("done")

done

In [13]:
# inserting data 
q= '''insert into s_details values(
057,"Divyanshu","BCA","Delhi");'''
cur.execute(q)
print ("Data Enter successfully")

Data Enter successfully

In [15]:
for i in range (5):
    sid= int(input("Enter Student id : "))
    name=input('Enter student name : ')
    course= input('Enter course : ')
    address= input('Enter address : ')
    q=f'''insert into s_details values ({sid},'{name}','{course}','{address}');'''
    cur.execute(q)
print ("data Enter")

Enter Student id :  026
Enter student name :  Anshika Rana
Enter course :  BCA
Enter address :  UP
Enter Student id :  027
Enter student name :  Nameesh Kadam
Enter course :  BA
Enter address :  HARYANA
Enter Student id :  013
Enter student name :  Niyati Singh
Enter course :  BCA
Enter address :  DELHI
Enter Student id :  035
Enter student name :  Vanshika Bhardwaj
Enter course :  BCA
Enter address :  DELHI
Enter Student id :  049
Enter student name :  Nandini Chandel
Enter course :  BCA
Enter address :  DELHI

data Enter

In [16]:
q3="select * from s_details;"
cur.execute(q3)
a=[]
for i in cur.description:
    a.append(i[0])
    # print(i)
r=cur.fetchall()
import pandas as pd 
pd.DataFrame(r,columns=a)

   SID             S_Name S_Course        Address
0   57          Divyanshu      BCA          Delhi
1   26            Anshika      BCA  Uttar Pradesh
2   35           Vanshika      BCA          DELHI
3   13             Niyati      BCA          DELHI
4   49            Nandini      BCA          DELHI
5   26       Anshika Rana      BCA             UP
6   27      Nameesh Kadam       BA        HARYANA
7   13       Niyati Singh      BCA          DELHI
8   35  Vanshika Bhardwaj      BCA          DELHI
9   49    Nandini Chandel      BCA          DELHI

In [17]:
def show_rec(db,table):
    q3=f'''select * from {db}.{table};'''
    cur.execute(q3)
    a=[]
    for i in cur.description:
        a.append(i[0])
        # print(i)
    r=cur.fetchall()
    import pandas as pd 
    rec=pd.DataFrame(r,columns=a)
    return rec

In [18]:
show_rec("day5","s_details")

   SID             S_Name S_Course        Address
0   57          Divyanshu      BCA          Delhi
1   26            Anshika      BCA  Uttar Pradesh
2   35           Vanshika      BCA          DELHI
3   13             Niyati      BCA          DELHI
4   49            Nandini      BCA          DELHI
5   26       Anshika Rana      BCA             UP
6   27      Nameesh Kadam       BA        HARYANA
7   13       Niyati Singh      BCA          DELHI
8   35  Vanshika Bhardwaj      BCA          DELHI
9   49    Nandini Chandel      BCA          DELHI

In [19]:
conn.close()